welcome = "Привіт! Мене звати Дейв 😃. Я віртуальний помічник викладача та адміністратор ОС AIX 🖥."

hint = "📌 Будь-ласка опиши свою проблему нижче, або скористайся меню."

sign_in = "Для того, щоб увійти у свій особистий кабінет пройдіть аутентифікацію за допомогою навчальної платформи Moodle 🗝. Для перевірки " \
          "треба надати свій номер мобільного телефону 📞 та e-mail 📬."

help = "Чат-бот для керування Workload Partitions у ОС AIX 🖥. Опиши свою проблему нижче, або скористайся меню 🤓. "

schedule = "Лабораторна група 1:\n"\
                "\tпон, сер: 14:05-16:40\n"\
                "Лабораторна група 2:\n"\
                "\tвівт, п'ят: 12:20-13:55\n\n"\
                "Графік складання лабораторних робіт:\n"\
                "Лабораторна робота №1: 3.02 - 14.02\n"\
                "Лабораторна робота №2: 17.02 - 28.02\n"\
                "Лабораторна робота №3: 2.03 - 13.03\n"\
                "Лабораторна робота №4: 16.03 - 27.03\n"\
                "Лабораторна робота №5: 30.03 - 10.04\n"\
                "Лабораторна робота №6: 13.04 - 24.04\n"\
                "Лабораторна робота №7: 27.04 - 8.05\n"\
                "Cкладання боргів:\n11.05 - 22.05\n\n"\
                "Залік - 25 травня 2021"

requirements =  "Вимоги до звіту з лабораторної роботи: \n"\
                "1) Звіт має бути обов'язково підписаний (містити прізвище та ім'я студента);\n"\
                "2) Шрифт: Times New Roman, розмір: 14, інтервал: 1.5;\n"\
                "3) Звіт має бути збереженим у форматі .pdf, розмір має бути не більше 2МБ;\n"\
                "4) Звіт має бути обов'язково завантаженим у систему Moodle Education;\n"\
                "5) Звіт має містити скріншоти виконання лабораторної роботи, сценаріїв та команд;\n"\
                "6) За сдачу не свого звіту за виконання лабораторної роботи ставиться 0 балів;\n"\
                "7) За не вчасну здачу лабораторної роботи за кожну неділю знімається 2 бали."

connect_ssh = "Для підключення до AIX віртуальної машини треба: \n"\
              "1) Завантажити PuTTY або будь-який інший ssh клієнт;\n"\
              "2) Треба у поле Host Name написати наступне login@ipAddress, де login - ваш логін, а ipAddress - ip адрес вашого WPAR (10.0.41.X);\n"\
              "3) Натиснути кнопку Open (для підключення)."

interesting_facts = ["Перша версія ОС AIX (Advanced Interactive eXecutive англ. /ˌeɪaɪˈɛks/) вийшла у 1986 році ⏱ та мала назву AIX/RT 2. "\
                     "Вона була побудованана базі UNIX System V 🔨.",

                     "У ОС AIX є помічник SMIT (System Management Interface Tool). З його допомогою можна не вводити довгі команди з великою кількістю "\
                     "аргументів 😉. Помічник SMIT представлений у графічному інтерфейсі, у Web-застосуванні та у командному рядку. Він значно полегшує "\
                     "роботу з ОС AIX та пришвидшує її адміністрування 😊. Без нього це б було робити набагато складніше 😩. Для того, щоб запустити помічник "\
                     "SMIT у командному рядку треба виконати команду smitty або smit -c (run).",

                     "У ОС AIX є графічна оболонка, вона має назву CDE (Common Desktop Environment) 🐨. Тривалий час була вона була класичною графічною оболонкою"\
                     "для ОС Unix (time). Але з часом у більшості ОС Unix була замінена на графічні оболонки GNOME та KDE 🐬.",

                     "Згідно даних компанії \"Enlyft\" (https://enlyft.com/tech/products/ibm-aix) ОС AIX у світі використовує 9,433 компанія 😃 (це скаладає "\
                     "0,47% від інших операційних систем 🤔).",

                     "У ОС AIX є своя технологія віртуалізації 🔨, вона називається WPAR (Workload Partitions) 😊. Вона підтримується у ОС AIX v.6.1 та вище 🐥."]

